package oop;

public class Ex01 {
	
	public static void main(String[] args) {
		
		// oop : object oriented programming (객체 지향 프로그래밍)
		// 자바 코드의 기본 단위는 클래스
		
		// pp : procedrual programming (절차 지향 프로그래밍)
		// procedure : 큰 범위에서 함수의 의미를 지닌다(function, method, procedure, routine..)
		
		// 서로다른 자료형의 변수들을 가져와서 하나의 형태로 묶는다 ==== 구조체
		// 보드마카의 잉크용량 = int / 브랜드 이름 = String
		// 함수는 동작 ?
		
		// 단순 자료형으로는 사람이 생각하는 데이터를 표현하는데 한계가 있다
		// 단순 데이터를 만들어서 사용하기 위한 형태 : 변수
		// 같은 자료형의 여러 데이터를 묶어서 표현하기 위한 형태 : 배열
		// 서로 다른 자료형의 여러 데이터를 묶어서 새로운 자료형을 표현하기 위한 형태 : 구조체(in C)
		// 서로 다른 자료형의 여러 데이터 + 동작, 기능을 표현하기 위한 함수를 포함하는 형태 : 클래스
		// 동작, 기능 : 함수
		// 명사형데이터 : 변수, 배열 // 동사형데이터 : 함수
		
		// 구조체에 의해 만들어진 데이터는 속성만 담고있어서 함수를 필수로 동반해야 한다
		// A타입에 필요한 함수는 일반적으로 B타입에 대하여 사용할 수 없다
		// A타입에 해당 함수를 내장시키면, A는 속성과 기능을 동시에 포함하는 형태가 된다 <- 객체
		// 객체를 만들어내기 위한 자료형을 클래스 라고 한다
		
		// 객체와 객체가 서로 데이터를 주고받는다 객체지향프로그래밍 클래스
		
		// 객체를 만들기 위해서 클래스가 필요하다
		// 객체끼리 데이터를 주고받게 한다
		// 메인함수는 스토리 보드라고 생각하면 된다
		
		
		
		
	}

}
